share/tutorials/incompressible/pimple/pitz_daily/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver           GAMG;
    tolerance        1e-7;
    relTol           0.01;
    smoother         DICGaussSeidel;
    cacheAgglomeration true;
    nCellsInCoarsestLevel 10;
    agglomerator     faceAreaPair;
    mergeLevels      1;
  }
  pFinal
  {
    $p;
    relTol          0;
  }
  "(U|k|epsilon)"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-05;
    relTol          0.1;
  }
  "(U|k|epsilon)Final"
  {
    $U;
    relTol          0;
  }
}
PIMPLE
{
  nNonOrthogonalCorrectors 0;
  nCorrectors         2;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
